saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
      <!-- ************************  Subfamily 'STM32F301'  **************************** -->
      <subFamily DsubFamily="STM32F301">
        <processor Dclock="72000000"/>

        <debugvars configfile="CMSIS/Debug/STM32F301_318.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00094350.pdf" title="STM32F301x6/8 and STM32F318x8 Reference Manual"/>
        <book name="Documentation/DM00093332.pdf" title="STM32F301x6 STM32F301x8 Dataheet"/>
        <book name="Documentation/DM00104412.pdf" title="STM32F301x6 STM32F301x8 Errata Sheet"/>

        <!-- *************************  Device 'STM32F301C6'  ************************** -->
        <device Dname="STM32F301C6">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F301x8"/>
          <debug svd="CMSIS/SVD/STM32F301x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F301C6Tx">
            <feature type="QFP" n="48"/>
          </variant>
          <!-- <variant Dvariant="STM32F301C6Yx"> <feature type="CSP" n="49"/> </variant> not supported by STM32CubeMX -->
        </device>

        <!-- *************************  Device 'STM32F301C8'  ************************** -->
        <device Dname="STM32F301C8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F301x8"/>
          <debug svd="CMSIS/SVD/STM32F301x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F301C8Tx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F301C8Yx">
            <feature type="CSP" n="49"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F301K6'  ************************** -->
        <device Dname="STM32F301K6">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F301x8"/>
          <debug svd="CMSIS/SVD/STM32F301x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="5"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="24"/>
          <feature type="DAC"           n="1"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="2"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <!-- <variant Dvariant="STM32F301K6Tx"> <feature type="QFP" n="32"/> </variant> not supported by STM32CubeMX -->
          <variant Dvariant="STM32F301K6Ux">
            <feature type="QFN" n="32"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F301K8'  ************************** -->
        <device Dname="STM32F301K8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F301x8"/>
          <debug svd="CMSIS/SVD/STM32F301x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available"> </sequence>
          </sequences>

