saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <memory id="IRAM2"                              start="0x10000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00058181.pdf" title="STM32F303xB STM32F303xC Datasheet"/>
          <book name="Documentation/DM00063985.pdf" title="STM32F303xB/C Errata Sheet"/>

          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="15"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F303CCTx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F303K6'  ************************** -->
        <device Dname="STM32F303K6">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F303x8"/>
          <debug svd="CMSIS/SVD/STM32F303x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available, not enough pins"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available, not enough pins"> </sequence>
          </sequences>

          <memory id="IROM1"                         start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                         start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"              default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"              default="0"/>

          <book name="Documentation/DM00092070.pdf" title="STM32F303x6/x8 Datasheet"/>
          <book name="Documentation/DM00109011.pdf" title="STM32F303x6/x8 Errata Sheet"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="9"       m="12"/>
          <feature type="IOs"           n="25"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F303K6Tx">
            <feature type="QFP" n="32"/>
          </variant>
          <variant Dvariant="STM32F303K6Ux">
            <feature type="QFN" n="32"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F303K8'  ************************** -->
        <device Dname="STM32F303K8">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h"  define="STM32F303x8"/>
          <debug svd="CMSIS/SVD/STM32F303x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available, not enough pins"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available, not enough pins"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <book name="Documentation/DM00092070.pdf" title="STM32F303x6/x8 Datasheet"/>
          <book name="Documentation/DM00109011.pdf" title="STM32F303x6/x8 Errata Sheet"/>

          <feature type="Timer"         n="7"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="9"       m="12"/>
          <feature type="IOs"           n="24"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="AnalogOther"   n="1"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="1"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="2"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F303K8Tx">
            <feature type="QFP" n="32"/>
          </variant>
          <variant Dvariant="STM32F303K8Ux">
            <feature type="QFN" n="32"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F303R6'  ************************** -->
        <device Dname="STM32F303R6">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F303x8"/>
          <debug svd="CMSIS/SVD/STM32F303x.svd"/>
          <sequences>
            <sequence name="EnableTraceTPIU"  info="ETM not available, not enough pins"> </sequence>
            <sequence name="DisableTraceTPIU" info="ETM not available, not enough pins"> </sequence>
          </sequences>

          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00003000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

