saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="2"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="3"      m="16"/>
          <feature type="ADC"           n="1"      m="12"/>
          <feature type="IOs"           n="84"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="I2S"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F373V8Tx">
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="STM32F373V8Hx">
            <feature type="BGA" n="100"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F373VB'  ************************** -->
        <device Dname="STM32F373VB">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F373xC"/>
          <debug svd="CMSIS/SVD/STM32F37x.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00006000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="2"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="3"      m="16"/>
          <feature type="ADC"           n="1"      m="12"/>
          <feature type="IOs"           n="84"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="I2S"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>

          <variant Dvariant="STM32F373VBTx">
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="STM32F373VBHx">
            <feature type="BGA" n="100"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F373VC'  ************************** -->
        <device Dname="STM32F373VC">
          <compile header="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h" define="STM32F373xC"/>
          <debug svd="CMSIS/SVD/STM32F37x.svd"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F3xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="2"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="3"       m="16"/>
          <feature type="ADC"           n="1"       m="12"/>
          <feature type="IOs"           n="84"/>
          <feature type="DAC"           n="3"       m="12"/>
          <feature type="SPI"           n="3"/>
          <feature type="I2C"           n="2"/>
          <feature type="I2S"           n="3"/>
          <feature type="USART"         n="3"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="105"/>

          <variant Dvariant="STM32F373VCTx">
            <feature type="QFP" n="100"/>
          </variant>
          <variant Dvariant="STM32F373VCHx">
            <feature type="BGA" n="100"/>
          </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F3x4'  **************************** -->
      <subFamily DsubFamily="STM32F3x4">
        <processor Dclock="72000000"/>

        <debugvars configfile="CMSIS/Debug/STM32F334.dbgconf">
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin   = 0x00040002;   // PE2
          __var TraceD0_Pin    = 0x00040003;   // PE3
          __var TraceD1_Pin    = 0x00040004;   // PE4
          __var TraceD2_Pin    = 0x00040005;   // PE5
          __var TraceD3_Pin    = 0x00040006;   // PE6
        </debugvars>

        <book name="Documentation/DM00093941.pdf" title="STM32F334xx Reference Manual"/>
        <book name="Documentation/DM00097745.pdf" title="STM32F334x4 STM32F334x6 STM32F334x8 Datasheet"/>
        <book name="Documentation/DM00115957.pdf" title="STM32F334x4/x6/x8 Errata Sheet"/>

