saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
          <book name="Documentation/DM00043574.pdf" title="STM32F303xB/C/D/E, STM32F303x6/8, STM32F328x8, STM32F358xC, STM32F398xE Reference Manual"/>
          <book name="Documentation/DM00149412.pdf" title="STM32F398VE Datasheet"/>
          <book name="Documentation/DM00150605.pdf" title="STM32F398VE Errata Sheet"/>

          <feature type="Timer"         n="9"       m="16"      name="IC/OC/PWM"/>
          <feature type="Timer"         n="1"       m="32"      name="IC/OC/PWM"/>
          <feature type="WDT"           n="2"/>
          <feature type="RTC"           n="32768"/>
          <feature type="ADC"           n="39"      m="12"/>
          <feature type="IOs"           n="88"/>
          <feature type="DAC"           n="2"       m="12"/>
          <feature type="AnalogOther"   n="4"                   name="Operational Amplifier"/>
          <feature type="SPI"           n="4"/>
          <feature type="I2C"           n="3"/>
          <feature type="USART"         n="5"/>
          <feature type="USBD"          n="1"/>
          <feature type="CAN"           n="1"/>
          <feature type="VCC"           n="2.00"    m="3.60"/>
          <feature type="Temp"          n="-40"     m="85"/>

          <variant Dvariant="STM32F398VETx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32F3">
      <description>STMicroelectronics STM32F3 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F3*"/>
    </condition>

    <!-- Device + CMSIS -->
    <condition id="STM32F3 CMSIS">
      <description>STMicroelectronics STM32F3 Series Device and CMSIS-Core</description>
      <require condition="STM32F3"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + STM32CubeMx -->
    <condition id="STM32F3 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F3 Series Device, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32F3"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <!--
    <condition id="STM32F301x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F301x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F301[CKR][68]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F302x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F302x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CKR][68]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F302xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F302xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CRV][BC]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F302xE CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F302xE Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[RVZ][DE]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F303x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F303x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CKR][68]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <condition id="STM32F303xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F303xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CRV][BC]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F303xE CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F303xE Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[RVZ][DE]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F373xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F373xC Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F373[CRV][8BC]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F334x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F334x8 Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F334[CKR][468]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
