saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
    <!--
    <condition id="STM32F318xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F318xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F318[CK][8]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F328xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F328xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F328[C][8]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F358xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F358xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F358[CRV][C]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F378xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F378xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F378[CRV][C]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->
    <!--
    <condition id="STM32F398xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F398xx Devices and CMSIS-Core</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F398[V][E]*"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
-->

    <condition id="STM32F303xE CMSIS STM32CubeMX SPI">
      <description>STMicroelectronics STM32F3 Devices, CMSIS-Core, STM32CubeMX and CMSIS SPI driver</description>
      <require condition="STM32F303xE CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
    </condition>

    <condition id="STM32F303E-EVAL CMSIS STM32CubeMX SPI GLCD">
      <description>STMicroelectronics STM32F3 Devices, CMSIS-Core, STM32CubeMX and SPI GLCD</description>
      <require condition="STM32F303xE CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
      <require Cclass="Graphics Display" Cgroup="STM32303E-EVAL" Cvariant="SPI IF"/>
    </condition>

    <condition id="STM32F3 CMSIS STM32CubeMX Graphics SPI GLCD">
      <description>STMicroelectronics STM32F3 Devices, CMSIS-Core, STM32CubeMX, Graphics core and SPI GLCD</description>
      <require condition="STM32F3 CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"  Cgroup="SPI"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="SPI IF"/>
    </condition>

    <condition id="STM32F3 STARTUP CORTEX GPIO RCC FLASH">
      <description>STMicroelectronics STM32F3 devices, Startup and HAL CORTEX, GPIO, RCC and FLASH</description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="CORTEX"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="FLASH"/>
    </condition>
    <condition id="STM32F3 HAL">
      <description>STMicroelectronics STM32F3 devices and HAL </description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F3 HAL DMA">
      <description>STMicroelectronics STM32F3 Devices, HAL, and DMA peripheral</description>
      <require condition="STM32F3 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F3 HAL FMC_LL">
      <description>STMicroelectronics STM32F3 Devices, HAL, and FMC LL peripheral</description>
      <require condition="STM32F3 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="FMC"/>
    </condition>
    <condition id="STM32F3 LL">
      <description>STMicroelectronics STM32F3 devices and LL </description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F3 STARTUP LL UTILS RCC PWR">
      <description>STMicroelectronics STM32F3 Device and LL</description>
      <require condition="STM32F3"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>

    <condition id="STM32F3 LL FMC">
      <description>FMC LL Component requirements</description>
      <require condition="STM32F3 LL"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="NAND"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <accept Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="PCCARD"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32F3xx ARMCC">
      <description>STMicroelectronics STM32F3xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F3*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F301x8 ARMCC">
      <description>STMicroelectronics STM32F301x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F301[CKR][68]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

