saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
    <condition id="STM32F302x8 ARMCC">
      <description>STMicroelectronics STM32F302x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CKR][68]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F302xC ARMCC">
      <description>STMicroelectronics STM32F302xC Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[CRV][BC]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F302xE ARMCC">
      <description>STMicroelectronics STM32F302xE Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F302[RVZ][DE]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F303x8 ARMCC">
      <description>STMicroelectronics STM32F303x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CKR][68]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F303xC ARMCC">
      <description>STMicroelectronics STM32F303xC Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[CRV][BC]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F303xE ARMCC">
      <description>STMicroelectronics STM32F303xE Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F303[RVZ][DE]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F373xC ARMCC">
      <description>STMicroelectronics STM32F373xC Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F373[CRV][8BC]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F334x8 ARMCC">
      <description>STMicroelectronics STM32F334x8 Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F334[CKR][468]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F318xx ARMCC">
      <description>STMicroelectronics STM32F318xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F318[CK][8]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F328xx ARMCC">
      <description>STMicroelectronics STM32F328xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F328[C][8]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F358xx ARMCC">
      <description>STMicroelectronics STM32F358xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F358[CRV][C]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F378xx ARMCC">
      <description>STMicroelectronics STM32F378xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F378[CRV][C]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32F398xx ARMCC">
      <description>STMicroelectronics STM32F398xx Devices and ARMCC Compiler</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F398[V][E]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>
  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir>
      <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.0.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>
  
  <components>
    <bundle Cbundle="STM32CubeMX" Cclass="Device" isDefaultVariant="true" Cversion="1.0.0">
      <description>Peripheral, Clock and Pin configuration are managed by STM32CubeMX</description>
      <doc>MDK\CubeMX\Documentation\index.html</doc>
      <component  Cgroup="Startup" condition="STM32F3 CMSIS STM32CubeMX">
        <description>System Startup for STMicroelectronics</description>
        <!-- Flash Option Bytes templates -->
        <files>
          <file category="source" condition="STM32F3xx ARMCC"  name="MDK/Device/Source/ARM/STM32F3xx_OPT.s" attr="template" select="Flash Option Bytes"/>
        </files>
      </component>
      <component generator="STM32CubeMX" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" condition="STM32F3">
        <description>Configuration via STM32CubeMX</description>
        <RTE_Components_h>
          #define RTE_DEVICE_FRAMEWORK_CUBE_MX
        </RTE_Components_h>
        <files>
          <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
          <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.1"/>
        </files>
      </component>

      <!-- STM32F3xx HAL Drivers -->
      <component Cgroup="STM32Cube HAL" Cversion="1.9.0" condition="STM32F3 CMSIS STM32CubeMX">
        <description>STM32Cube HAL Drivers</description>
        <RTE_Components_h>
          #define RTE_DEVICE_CUBE_MX_HAL
        </RTE_Components_h>
        <files>
          <file category="source"  name="MDK/Driver/stm32f3xx_ll.c"/>
          <file category="include" name="Drivers/STM32F3xx_HAL_Driver/Inc/"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_adc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_adc_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_can.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_cec.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_comp.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_cortex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_crc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_crc_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_dac.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_dac_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_dma.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_flash.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_flash_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_gpio.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_hrtim.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2c.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2c_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2s.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_i2s_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_irda.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_iwdg.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_nand.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_nor.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_opamp.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_opamp_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pccard.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pcd.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pcd_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pwr.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_pwr_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rcc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rcc_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rtc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_rtc_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_sdadc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_smartcard.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_smartcard_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_smbus.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_spi.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_spi_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_sram.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_tim.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_tim_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_tsc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_uart.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_uart_ex.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_usart.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_wwdg.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_adc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_comp.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_crc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_dac.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_dma.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_exti.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_fmc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_gpio.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_hrtim.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_i2c.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_opamp.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_pwr.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_rcc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_rtc.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_spi.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_tim.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_usart.c"/>
          <file category="source"  name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_ll_utils.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="Standalone" Cclass="Device" Cversion="1.0.0">
      <description>All HAL and LL peripheral APIs are selectable as individual components.</description>
      <doc></doc>
      <component  Cgroup="Startup" condition="STM32F3 CMSIS">
        <description>System Startup for STMicroelectronics</description>
        <RTE_Components_h>
          #define RTE_DEVICE_STARTUP_STM32F3XX    /* Device Startup for STM32F3 */
        </RTE_Components_h>

        <files>
          <!--  include folder -->

          <file category="include" name="Drivers/CMSIS/Device/ST/STM32F3xx/Include/"/>

          <!-- Flash Option Bytes templates -->
          <file category="source" condition="STM32F3xx ARMCC" name="MDK/Device/Source/ARM/STM32F3xx_OPT.s" attr="template" select="Flash Option Bytes"/>

