saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
          <file category="header" name="Drivers/CMSIS/Device/ST/STM32F3xx/Include/stm32f3xx.h"/>

          <!-- startup files -->
          <!-- ARM Compiler Toolchain -->
          <file category="source" condition="STM32F301x8 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f301x8.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F302x8 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f302x8.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F302xC ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f302xc.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F302xE ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f302xe.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F303x8 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f303x8.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F303xC ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f303xc.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F303xE ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f303xe.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F318xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f318xx.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F328xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f328xx.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F334x8 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f334x8.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F358xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f358xx.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F373xC ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f373xc.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F378xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f378xx.s" attr="config" version="2.3.2"/>
          <file category="source" condition="STM32F398xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/arm/startup_stm32f398xx.s" attr="config" version="2.3.2"/>

          <!-- system file -->
          <file category="source" name="Drivers/CMSIS/Device/ST/STM32F3xx/Source/Templates/system_stm32f3xx.c" attr="config" version="2.3.2"/>
        </files>
      </component>
      <!-- STM32F3xx HAL Drivers -->
      <component Cgroup="STM32Cube HAL" Csub="COMMON" Cversion="1.9.0" condition="STM32F3 STARTUP CORTEX GPIO RCC FLASH">
        <description>Common HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_COMMON
        </RTE_Components_h>
        <files>
          <file category="header" name="Drivers/STM32F3xx_HAL_Driver/Inc/Legacy/stm32_hal_legacy.h"/>
          <file category="header" name="Drivers/STM32F3xx_HAL_Driver/Inc/stm32f3xx_hal.h"/>
          <file category="header" name="Drivers/STM32F3xx_HAL_Driver/Inc/stm32f3xx_hal_def.h"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal.c"/>
          <file category="header" name="MDK/Templates/Inc/stm32f3xx_hal_conf.h" attr="config"   version="1.9.0"/>
          <file category="source" name="MDK/Templates/Src/stm32f3xx_hal_msp.c"  attr="template" select="MCU Specific HAL Initialization / De-Initialization"/>
          <file category="header" name="MDK/Templates/Inc/stm32f3xx_it.h"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="source" name="MDK/Templates/Src/stm32f3xx_it.c"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="header" name="MDK/Templates/Inc/main.h"               attr="template" select="'main' module for STM32Cube"/>
          <file category="source" name="MDK/Templates/Src/main.c"               attr="template" select="'main' module for STM32Cube"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="ADC" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Analog-to-digital converter (ADC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_ADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_adc.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_adc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CAN" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Controller area network (CAN) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CAN
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_can.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CEC" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Consumer Electronics Control (CEC) HAL driver </description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CEC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_cec.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="COMP" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Analog Comparator (CRC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_COMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_comp.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CORTEX" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>Cortex HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CORTEX
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_cortex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CRC" Cversion="1.9.0" condition="STM32F3 HAL">
        <description>CRC calculation unit (CRC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CRC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_crc.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_crc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="DAC" Cversion="1.9.0" condition="STM32F3 HAL DMA">
        <description>Digital-to-analog converter (DAC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_DAC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_dac.c"/>
          <file category="source" name="Drivers/STM32F3xx_HAL_Driver/Src/stm32f3xx_hal_dac_ex.c"/>
        </files>
      </component>
