saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32F3xx_DFP.2.1.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="SPI"                          Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>SPI Driver for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
        #define RTE_Drivers_SPI4                /* Driver SPI4 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32F3xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART IrDA"      Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>USART Driver (IrDA mode) for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_IrDA         /* Driver USART1 */
        #define RTE_Drivers_USART2_IrDA         /* Driver USART2 */
        #define RTE_Drivers_USART3_IrDA         /* Driver USART3 */
        #define RTE_Drivers_USART4_IrDA         /* Driver USART4 */
        #define RTE_Drivers_USART5_IrDA         /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/IrDA_STM32F3xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART SmartCard" Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>USART Driver (SmartCard mode) for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_SmartCard    /* Driver USART1 */
        #define RTE_Drivers_USART2_SmartCard    /* Driver USART2 */
        #define RTE_Drivers_USART3_SmartCard    /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32F3xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART Async"     Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>USART Driver (Async mode) for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_Async        /* Driver USART1 */
        #define RTE_Drivers_USART2_Async        /* Driver USART2 */
        #define RTE_Drivers_USART3_Async        /* Driver USART3 */
        #define RTE_Drivers_USART4_Async        /* Driver USART4 */
        #define RTE_Drivers_USART5_Async        /* Driver USART5 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32F3xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART Sync"      Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>USART Driver (Sync mode) for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_Sync         /* Driver USART1 */
        #define RTE_Drivers_USART2_Sync         /* Driver USART2 */
        #define RTE_Drivers_USART3_Sync         /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USART_STM32F3xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device"                   Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
      <description>USB Device Driver for STM32F3 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USBD_STM32F3xx.c"/>
      </files>
    </component>

    <!-- STM32F3 Generic CubeMX Board Support -->
    <bundle Cbundle="STM32F3-CubeMX" Cclass="Board Support" Cversion="0.9.0">
      <description>Generic CubeMX Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
        <description>LED driver for STMicroelectronics STM32F3 CubeMX configured targets</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F3-CubeMX/Common/LED_STM32F3-CubeMX.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
        <description>Button driver for STMicroelectronics STM32F3 CubeMX configured targets</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F3-CubeMX/Common/Buttons_STM32F3-CubeMX.c"/>
        </files>
      </component>
      <!--component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F3 CMSIS STM32CubeMX">
        <description>A/D Converter driver for STMicroelectronics STM32F3 CubeMX configured targets</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F3-CubeMX/Common/ADC_STM32F3-CubeMX.c"/>
        </files>
      </component-->
    </bundle>

    <!-- STM32F3-Discovery Board Support -->
    <bundle Cbundle="STM32F3-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32F3-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F303xC CMSIS STM32CubeMX">
        <description>LED driver for STMicroelectronics STM32F3-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F3-Discovery/Common/LED_STM32F3-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F303xC CMSIS STM32CubeMX">
        <description>Button driver for STMicroelectronics STM32F3-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F3-Discovery/Common/Buttons_STM32F3-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F334-Discovery Board Support -->
    <bundle Cbundle="STM32F334-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32F334-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F334x8 CMSIS STM32CubeMX">
        <description>LED driver for STMicroelectronics STM32F334-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F334-Discovery/Common/LED_STM32F334-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F334x8 CMSIS STM32CubeMX">
        <description>Button driver for STMicroelectronics STM32F3-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F334-Discovery/Common/Buttons_STM32F334-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32373C-EVAL Board Support -->
    <bundle Cbundle="STM32373C-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32373C-EVAL Board</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F373xC CMSIS STM32CubeMX">
        <description>A/D Converter driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32373C-EVAL/Common/ADC_STM32373C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F373xC CMSIS STM32CubeMX">
        <description>Graphic LCD driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32373C-EVAL/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32373C-EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32373C-EVAL/Common/GLCD_SPI_STM32373C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F373xC CMSIS STM32CubeMX">
        <description>Button driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32373C-EVAL/Common/Buttons_STM32373C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F373xC CMSIS STM32CubeMX">
        <description>LED driver for STMicroelectronics STM32373C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32373C-EVAL/Common/LED_STM32373C-EVAL.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32303C-EVAL Board Support -->
    <bundle Cbundle="STM32303C-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32303C-EVAL Board</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F303xC CMSIS STM32CubeMX">
        <description>A/D Converter driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303C-EVAL/Common/ADC_STM32303C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD" Capiversion="1.0.0" condition="STM32F303xC CMSIS STM32CubeMX">
        <description>Graphic LCD driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="header"  name="MDK/Boards/ST/STM32303C-EVAL/Common/GLCD_Config.h"/>
          <file category="source"  name="MDK/Boards/ST/STM32303C-EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32303C-EVAL/Common/GLCD_SPI_STM32303C-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F303xC CMSIS STM32CubeMX">
        <description>Button driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32303C-EVAL/Common/Buttons_STM32303C-EVAL.c"/>
        </files>
      </component>
